<a href="https://colab.research.google.com/github/ernifang/Bootcamp_Python_by_SanberCode/blob/main/Week%202%20-%20Pandas/Tugas_Hari_2_Pekan_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [53]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id pelajaran  nilai jenis-kelamin kelas
0         1    Fisika     40     perempuan   12C
1         2     Kimia     51     perempuan   12C
2         3     Kimia     86     perempuan   12D
3         4     Kimia     97     laki-laki   12B
4         5     Kimia     43     perempuan   12C

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [54]:
# code here
print(df[['nilai','kelas']])
print(df.loc[5:10,'pelajaran':'nilai'])

    nilai kelas
0      40   12C
1      51   12C
2      86   12D
3      97   12B
4      43   12C
5      84   12D
6      11   12D
7      83   12B
8      83   12A
9      72   12C
10     47   12D
11     34   12D
12     64   12B
13     67   12A
14     24   12A
15     50   12B
16     60   12C
17     24   12C
18     16   12C
19     53   12D
     pelajaran  nilai
5      Geologi     84
6   Matematika     11
7      Ekonomi     83
8      Biologi     83
9   Matematika     72
10      Fisika     47

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [24]:
# code here 
df[(df.pelajaran =='Fisika') | (df.pelajaran =='Ekonomi')]

    siswa_id pelajaran  nilai jenis-kelamin kelas
3          4   Ekonomi     89     laki-laki   12D
10        11    Fisika     23     perempuan   12A
14        15    Fisika     62     perempuan   12D
17        18    Fisika     21     perempuan   12A

In [55]:
df[(df.pelajaran =='Kimia') & (df.nilai > 50)]

    siswa_id pelajaran  nilai jenis-kelamin kelas
1          2     Kimia     51     perempuan   12C
2          3     Kimia     86     perempuan   12D
3          4     Kimia     97     laki-laki   12B
16        17     Kimia     60     laki-laki   12C
19        20     Kimia     53     laki-laki   12D

In [56]:
df[(df.kelas =='12C') & (df.nilai > 70) & (df['jenis-kelamin'] == 'perempuan')]

   siswa_id   pelajaran  nilai jenis-kelamin kelas
9        10  Matematika     72     perempuan   12C

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [62]:
def normalisasi(x):
  return (x - x.min()) / (x.max()-x.min())

nmin = df.nilai.min()
nmax = df.nilai.max()
print('nilai minimum : ' +str(nmin))
print('nilai maksimum : ' +str(nmax))
print(df[['nilai']].apply(normalisasi))

nilai minimum : 0.1134020618556701
nilai maksimum : 1.0
       nilai
0   0.337209
1   0.465116
2   0.872093
3   1.000000
4   0.372093
5   0.848837
6   0.000000
7   0.837209
8   0.837209
9   0.709302
10  0.418605
11  0.267442
12  0.616279
13  0.651163
14  0.151163
15  0.453488
16  0.569767
17  0.151163
18  0.058140
19  0.488372